export default {
    error:[
        {
          type:'E1',
          name:'进水故障',
          title:'E1',
          select:false,
          telDes:'请联系专业的维修人员400-0000-4008',
          telBtn:['我已了解','联系客服'],
          detail:[
            {name: "水压太低",dec: "检查清理"},
            {name: "进水管堵塞或者打折", dec: "检查清理" },
            {name: "水龙头未打开", dec: "检查清理" },
            {name: "其他", dec: "请专业的维修人员维修"},
          ],
          reason:[
            "请确认以下三点是否解决",
            "1.水压太低",
            "2.进水管堵塞/打折",
            "3.水龙头未打开"
          ]
        },
        {
            type:'E3',
            title:'E3',
            name:'加热异常',
            select:false,
            telDes:'请联系专业的维修人员400-0000-4008',
            telBtn:['我已了解','联系客服'],
            detail:[
                {name: "加热回路发生故障",dec: "请专业的维修人员维修"},
            ],
            reason:["请联系专业维修人员", "400-889-9315"],
        },
        {
            type:'E4',
            title:'E4',
            name:'发生溢流',
            select:false,
            telDes:'请联系专业的维修人员400-0000-4008',
            telBtn:['我已了解','联系客服'],
            detail:[
                {name: "使用清洁精",dec: "检查清理"},
                {name: "进水管堵塞或者打折", dec: "检查清理" },
                {name: "地面不平", dec: "检查清理" },
                {name: "外部积水流入机器", dec: "检查清理" },
                {name: "洗碗机某部件漏水", dec: "请专业的维修人员维修" }
            ],
            reason:[
                "请确认以下四点是否解决",
                "1.使用清洁精",
                "2.排水管堵塞/打折",
                "3.地面不平",
                "4.外部积水流入机器"
            ],
        },
        {
            type:'Ed',
            title:'Ed',
            name:'通讯提示',
            select:false,
            telDes:'请联系专业的维修人员400-0000-4008',
            telBtn:['我已了解','联系客服'],
            detail:[
                {name: "通讯异常",dec: "请专业的维修人员维修"},
            ],
            reason:["请联系专业维修人员", "400-889-9315"],
        },
    ],
    problem:[
        {
            type: "problem1",
            name:'洗碗机不通电',
            select:false,
            detail:[
                {name: "没有连接电源", dec: "确保电源线插头和插座连接好" }
            ]
        },
        {
            type: "problem2",
            name:'洗碗机排水不畅',
            select:false,
            detail:[
                { name: "排水管打结", dec: "检查排水管" },
                { name: "过滤网阻塞", dec: "检查过滤器系统" },
                { name: "厨房下水道堵塞", dec: "检查厨房下水道确保排水畅通" },
                { name: "排水塞子未拔掉", dec: "检查洗碗机排水管口确保塞子拔掉" }
            ]
        },
        {
            type: "problem3",
            name:'内碗里有泡沫',
            select:false,
            detail:[
                {
                    name: "洗碗粉使用不正确",
                    dec:
                      "为了避免泡沫的产生，请使用洗碗机专用的洗碗粉，如果发生这种情况，请打开洗碗机让泡沫挥发掉，在内胆里面添加2～3升水，关上洗碗机门，运行任洗涤程序约20～30秒后关掉电源可将水排出，反复进行以上操作，直到泡沫清除为止"
                },
                { name: "洗碗粉过期，发霉", dec: "使用有效期内的洗碗粉" }
            ]
        },
        {
            type: "problem4",
            name:'机器内胆有撞击声',
            select:false,
            detail:[
                {name: "喷臂可能被餐具卡住", dec: "中断正在运行的程序，重新摆放阻碍喷臂转到的餐具"}
            ]
        },
        {
            type: "problem5",
            name:'内胆内壁有水珠',
            select:false,
            detail:[
                {name: "属于正常现象",dec: "程序运行结束后将洗碗机微微打开有利于内部干燥"}
            ]
        },
        {
            type: "problem6",
            name:'餐具洗不干净',
            select:false,
            detail:[
                { name: "餐具摆放不正确", dec: "参考‘餐具摆放’" },
                { name: "洗碗粉的量不够", dec: "增加洗碗粉的使用量，使用专门的洗碗粉"},
                { name: "餐具的摆放影响喷臂的转动", dec: "重新摆放餐具，让喷臂能自由转动"},
                { name: "过滤网堵塞或者洗碗机太久不清洗", dec: "清洁过滤器，定期清洁洗碗机"}
            ]
        },
        {
            type: "problem7",
            name:'餐具没有完全干燥',
            select:false,
            detail:[
                { name: "不正确的装载", dec: "按摆放指导中的摆放建议摆放餐具" },
                { name: "餐具取出过早", dec: "程序运行结束后不要立即取出餐具，轻轻打开机门放出蒸汽，等餐具不再烫手再取出"},
                { name: "使用的餐具表面处理不佳", dec: "附着在这种喷涂表面的水很难沥干，这种类型的刀叉碗碟不适合机洗"},
                { name: "光亮剂太少", dec: "增加光亮剂的用量，或者重新装满光亮剂" },
                { name: "洗涤程序选择不正确",dec: "‘预洗’程序无干燥功能，请选择其他程序"}
            ]
        },
        {
            type: "problem8",
            name:'粉盒内有洗碗粉残留',
            select:false,
            detail:[
                { name: "餐具阻碍了洗碗粉盒的打开", dec: "重新正确地把碗碟摆放在碗蓝上"},
                { name: "喷臂转动不顺畅", dec: "检查喷臂是否碑餐具卡住不能转动" },
                { name: "‘预洗’程序投放洗碗粉不正确", dec: "参考添加洗碗粉" }
            ]
        },
    ]
}