<template>
    <div class="helpItem" :style="objClass">
        <midea-header :title="'使用帮助'" :titleText="'#000000'" :bgColor="'#ffffff'" :isImmersion="true" :showRightImg="false" @leftImgClick="goBack"></midea-header>
        <div style="width:750px;height:20px;background-color:rgb(242,242,242)"></div>
        <div class="wrapper" :style="wrapper">
            <text class="title">{{title}}</text>
            <text class="content">{{content}}</text>
        </div>
        <div style="width:750px;height:220px;background-color:white;align-self:flex-end;"></div>
    </div>
</template>
<script>
import nativeService from '@/common/services/nativeService'
import mideaHeader from './components/mheader1.vue'

export default {
    components:{mideaHeader},
    data(){
        return{
            height:1000,
            title:'',
            content:'',
        }
    },
    methods:{
        goBack(){
            nativeService.goBack();
        },
        showItem(){
            var self=this;
            nativeService.getItem('helpKey',function(i){
                switch(i.data){
                    case "0":
                        self.title='布谷厨下式净水器是采用哪种净水技术？';
                        self.content='布谷厨下式净水器采用反渗透五级精滤技术，提供健康直饮水。目前家用净水器过滤技术主要可分为微滤、超滤、反渗透。\n微滤（MF）过滤精度一般在0.1~1微米。用于简单的粗过滤，过滤水中的泥沙、铁锈等大颗粒杂质，一般不能去除水中的细菌、病毒等有害物质。滤芯通常不能清洗，为一次性过滤材料，需要经常更换。大家经常使用的过滤水壶就属于微滤。\n超滤（UF）过滤精度在0.01~0.1微米。可滤除水中的铁锈、泥沙、悬浮物、胶体、部分细菌等有害物质，不能去除重金属、水垢等。\n反渗透（RO）理论过滤精度达到0.0001微米，比超滤、微滤过滤精度高，反渗透技术能有效滤除水中的泥沙、铁锈、悬浮物、胶体、细菌、病毒、重金属、水垢、有机物等。\n布谷厨下式净水器采用的就是反渗透过滤。';
                    break;
                    case "1":
                        self.title='MIX一体复合滤芯区别于传统的多根滤芯有哪些好处？';
                        self.content='MIX一体式复合滤芯，技术升级的同时，精滤效果不打折，有效滤除重金属、余氯、细菌等有害物质，深度过滤，出水达直饮水标准。\n区别于传统的多根滤芯，全封装的水路系统更安全可靠，防止污染物进入，过滤效果优于传统滤芯，体积也大大减小。换芯也更加方便，一根芯更换轻松，换芯成本也大大减少。\n而且布谷厨下式净水器滤芯横置，相对于传统的竖放，滤芯净水更平稳，噪音更低，整机性能更强更稳定。';
                    break;
                    case "2":
                        self.title='为什么有浓缩水？浓缩水有什么用途？';
                        self.content='反渗透净水器的理论过滤精度达到0.0001微米，比超滤、微滤技术过滤精度高。微滤和超滤都不会产生废水，但不能滤除水中的重金属、水垢、有机物等。\n布谷厨下式净水器在出纯水的同时，将自来水中的细菌、病毒、重金属等有害物质随着浓缩水排出，可以有效的防止反渗透膜的浓差极化和早期堵塞。所以，反渗透净水器在正常工作时，会有纯水和浓缩水同时排出，属于正常现象。\n反渗透净水器的浓缩水经过了PP棉和活性炭两层过滤，除了含盐量比自来水略高，其他大多数指标，都比自来水好。所以浓缩水可以用来洗菜、刷锅、洗碗、抹桌子、洗衣服、拖地板、冲厕所等。';
                    break;
                    case "3":
                        self.title='布谷厨下式净水器废水比是多少？';
                        self.content='废水比是指净水器工作过程中，产生的纯水和浓缩水（废水）的比例。在标准测试条件下，即水温25℃，水压0.2MPa情况下，布谷厨下式净水器设计废水比为1:1。\n废水比会受以下几个条件的影响：\n水温：水温低于25℃情况下，温度越低废水比越低，会出现浓缩水多于纯水的现象。水温高于25℃的情况下，温度越高废水比会越高，会出现纯水多于浓缩水的现象，但水温不可超过RO膜的耐受范围5-38℃。\n水压：低于标准状况0.2MPa，水压越低废水比越低，也会导致浓缩水多于纯水。\n进水水质较差：污染物会有堵塞滤芯的风险，造成废水比偏低；\n滤芯寿命到期：滤芯上会拦截很多污染物，造成滤芯堵塞，进而造成废水比偏低。\n膜通量：膜通量通常会有±20％的偏差，也会造成废水比的偏差。';
                    break;
                    case "4":
                        self.title='首次使用，纯水为什么会有少量气泡和黑水？';
                        self.content='净水器在首次使用时，需要将机器内的空气排尽才能正常出水，所以首次制得的纯水会有少量气泡，长期使用后，此现象会消失。另外，颗粒活性炭滤芯在运输过程中，会产生微量的炭粉，这些炭粉会在首次使用时随着纯水和浓缩水排出，形成微量的黑水，首次使用冲洗15分钟左右即可消除此类现象。';
                    break;
                    case "5":
                        self.title='出水为什么呈乳白色？';
                        self.content='出水呈乳白色是因为有气体溶解在水中。自来水在通过自来水管网加压输送时，在较高压力作用下，管网内存在的气体以及大气中的气体在水中的溶解度增大，大量溶于自来水中。\n而自来水在经过反渗透膜过滤时还必须经过水泵加压以增加动力，水泵在给水体加压的同时，又对水体中溶解的气体增加了压力，气体溶解度进一步增加。当这些气体经过反渗透膜时又被反渗透膜打成更细小的气泡。\n由于系统内部一直存在压力，气体无法被释放，当这部分水流出系统时，所受的压力突然消失，于是便膨胀成了我们肉眼可以观察到的大量微小的气泡，外观看起来呈乳白色，静置后气泡自然消失变成清澈，与水质无任何关系。\n纯水和浓缩水均会有这种现象，这是正常的纯物理现象，不会影响到纯水的饮用。';
                    break;
                    case "6":
                        self.title='制水时为什么会有声音？';
                        self.content='布谷厨下式净水器为了实现即滤即饮新鲜水，避免储水桶二次污染，所以采用400加仑大通量配置，水流速度达到1.0-1.3L/min，比普通净水器0.12L/min要大8倍。\n大的水量，就要有大功率的净水增压泵来为进水增压，所以会有电机转动的声音。布谷厨下式净水器采用了全球最好的净水增压泵，该声音为增压泵工作中，电机的声音、膜片增压的声音和水流等综合声音。布谷厨下式净水器工作时发出的声音是同行业内比较低的。';
                    break;
                    case "7":
                        self.title='长期饮用纯水会不会缺少矿物质？';
                        self.content='纯水是指以符合生活饮用水卫生标准的水为原水，通过电渗析法、离子交换法、反渗透法、蒸馏法等加工方法制得的不含任何添加物、可直接饮用的水。\n首先我们喝水目的在于摄取身体新陈代谢所需的水分而非营养物质，其次人体所需的营养物质主要是从一日三餐中摄取的，矿物质的摄入主要是靠饮食。\n例如：一杯牛奶的含钙量相当于1200杯矿泉水的含钙量，一斤牛肉的含铁量相当于8200杯矿泉水的含铁量。这些说明人体的营养摄入主要依靠食物而不是饮用水！水果、蔬菜、鸡鸭鱼肉等食物，才是我们获取矿物质和微量元素的主要来源。\n饮水最重要的是洁净和安全，布谷厨下式净水器净化后的纯水安全卫生，长期饮用并不会缺少矿物质，反而可以避免水污染对健康的威胁。';
                    break;
                    case "8":
                        self.title='什么是TDS，TDS反映了什么？布谷厨下式净水器如何查看水质情况？';
                        self.content='TDS为溶解性总固体（Total dissolved solids）的缩写，它表明1升水中溶解有多少毫克溶解性固体，单位为毫克／升（mg/L）或ppm。溶解性总固体包括不易挥发的可溶性盐类、有机物及能通过过滤装置的不溶性微粒等。钙、镁离子的可溶性盐类是形成水垢的主要成分。\n一般情况下，TDS值越高，表明水中的溶解性固体越多，水质越差。经过反渗透净水器过滤后，TDS会大幅度减少。自来水与纯水的TDS差异，反映了净水器的过滤效果。\n布谷厨下式净水器具有实时监测水质的功能，智能水龙头可实时显示进、出水TDS值，显示屏蓝灯亮表示水质正常，红灯亮表示水质异常；灯环水龙头亮蓝光表示水质正常，亮红光表示水质异常。APP上也可以实时显示进、出水TDS值，水质情况一目了然。';
                    break;
                    case "9":
                        self.title='为什么今天安装，APP显示有昨天记录？';
                        self.content='由于用户未联网，或者网络异常等原因会导致用户用水记录详情数据的丢失。为了保证在用水记录详情数据丢失的情况下保证用水总量的准确，因此采用了设备统计用水总量的策略。在设备未联网之前，设备的时间无法同服务器时间进行同步，因此统一把联网之前的用水记录归类为前一天的用水记录，才会导致今天安装，APP却显示昨天的用水记录。为了准确显示用水记录，用户可以在连接网络之后使设备时间同服务器时间进行同步之后，再使用净水器。';
                    break;
                    case "10":
                        self.title='APP上的净水总量省钱描述是怎么计算的？';
                        self.content='净水量1L水按2元，1桶按5L计算。\n例：累计净水300L，净水量相当于（300/5）60桶矿泉水，大约为您省下了（300*2）600元人民币。此计算方法意在对比使用净水器和购买纯净水的生活成本，仅供参考。';
                    break;
                    case "11":
                        self.title='APP中始终显示设备离线，或无法连接WiFi，如何解决？';
                        self.content='首先确定电源连接是否正常，净水器是否上电开机，并正常运行；其次检查WiFi是否正常；如还是显示离线，请拔掉电源线，10秒钟后再上电，长按净水器上WiFi按键3秒，重置WiFi并重新绑定净水器。';
                    break;
                    case "12":
                        self.title='水龙头红灯亮、APP报警水质异常如何处理？';
                        self.content='首先确认水源是否为市政自来水，检查水源水质是否异常；若水源正常，确认是否长期停用净水器（超过3天），若长期停用，请先打开水龙头，冲洗3-5分钟；如还是显示水质异常，请拨打电话售后热线400-930-9983，确认滤芯是否失效或过期，更换滤芯即可。';
                    break;
                    case "13":
                        self.title='APP中报警制水时间过长,智能水龙头显示E6如何处理？';
                        self.content='布谷厨下式净水器具备制水保护功能，连续处于制水状态时间达到2个小时，机器全部图标闪烁，智能水龙头显示E6，机器强制待机。此时请先关闭机器，再重新上电。';
                    break;
                    case "14":
                        self.title='APP中报警滤芯异常，智能水龙头显示E7/E8是什么问题，如何处理？';
                        self.content='布谷厨下式净水器具有滤芯智能识别功能，可对滤芯进行正伪识别。采用RFID无线射频技术，可轻松识别即将更换的滤芯的剩余寿命，并记忆滤芯寿命，其他品牌的滤芯或者废旧的滤芯都会被识别，从而保证用户使用的是原装的新滤芯。\n滤芯异常时，机器全部图标闪烁并待机，若为RFID通讯故障，智能龙头显示E7，若非标准RFID故障或检测不到滤芯，智能龙头显示E8。\n报警滤芯异常时，首先确认滤芯是否为原装滤芯，可在布谷APP中查询正伪。如若滤芯不是正品，请购买更换正品滤芯；若滤芯是正品，请拨打服务热线400-930-9983报障，确认RFID模块是否损坏失效。\n';
                    break;
                    case "15":
                        self.title='APP中报警水龙头通讯故障，智能水龙头显示E9如何解决？';
                        self.content='若APP中出现水龙头通信故障报警，智能龙头显示E9，机器还可正常工作，此时请先关闭机器，检查水龙头连接线是否接触不良，再重新上电。如还是显示通信故障，请拨打服务热线400-930-9983报障。';
                    break;
                    case "16":
                        self.title='APP中报警TDS通讯故障，智能水龙头显示“---”如何解决？';
                        self.content='若APP中出现TDS通讯故障报警，智能龙头显示---，机器还可正常工作，此时请先关闭机器，检查水龙头连接线是否接触不良，再重新上电。如还是显示通讯故障，请拨打服务热线400-930-9983报障';
                    break;
                    case "17":
                        self.title='净水器出水量下降异常如何解决？';
                        self.content='首先检查进水球阀或水龙头是否完全打开；其次确认滤芯是否已过期，如已超期需要更换滤芯；如出水量还是下降异常，检查滤芯是否被堵塞，此时需要冲洗或更换滤芯。';
                    break;
                    case "18":
                        self.title='打开水龙头不出水是什么问题？';
                        self.content='首先检查其他的自来水水龙头是否有水；其次打开APP查看是否有故障提醒（智能龙头显示屏有故障代码提醒）；如还是不出水，请拨打服务热线400-930-9983报障。';
                    break;
                    case "19":
                        self.title='布谷厨下式净水器冬季如何进行防冻保养？';
                        self.content='冬季使用时，请勿将净水器放置在0℃以下的环境中，以免净水器内部受温度影响而结冰，若不及时解冻即使用将有可能导致滤芯或其他零部件因冻裂而发生漏水。当进水温度低至0℃时，请关闭进水球阀并开启净水龙头，将净水器内的水排出，防止结冰冻裂。如果发现净水器已结冰，请在解冻的情况下，确认产品是否有漏水现象。如有漏水，请及时拨打售后热线：400-930-9983。';
                    break;
                    case "20":
                        self.title='滤芯需要多久更换一次？';
                        self.content='滤芯使用周期不是质量保证期限，是以原水符合生活饮用水国家标准，以一般家庭正常用水为基准的理想滤芯使用周期。\n滤芯使用周期是预计期，因使用地域、水质、使用量及季节不同而导致实际使用周期有所不同。滤芯要定期更换，滤芯如果到期不更换水量会变小，反渗透膜的寿命会下降，长期不更换净水品质也会受到影响，只有适时更换滤芯才能喝上纯净的水。\n布谷厨下式净水器综合滤芯的实际用水量、使用时间和出水水质变化等因素计算其寿命，MIX一体复合滤芯建议一年更换一次。';
                    break;
                    case "21":
                        self.title='滤芯有哪些状态？';
                        self.content='正常状态\n滤芯状态显示剩余寿命百分比，滤芯正常使用。\n异常状态\n滤芯状态不显示剩余寿命百分比，滤芯过期或滤芯损坏。此时需更换滤芯，换芯步骤见更多—产品指南—清洁保养中滤芯更换详细步骤。';
                    break;
                    case "22":
                        self.title='布谷厨下式净水器尺寸多少，有多重？';
                        self.content='布谷厨下式净水器尺寸为315x400x161mm，约7Kg。';
                    break;
                    case "23":
                        self.title='布谷厨下式净水器标配包含什么？';
                        self.content='布谷厨下式净水器的标配包括：主机x1、MIX一体复合滤芯x1、水龙头x1、 1/4英寸PE管x1、进水球阀x1、2分接口卡销x8、产品使用说明书x1。';
                    break;
                }
            })
        }
    },
    created() {
       this.height=parseInt(Math.floor(750/this.$getConfig().env.deviceWidth*this.$getConfig().env.deviceHeight))+220;
       this.showItem();
    },
    mounted(){
    },
    computed:{
        objClass:function(){
            return {height:this.height+'px'}
        },
        wrapper:function(){
            return {height:this.height*0.886+'px'}
        }
    }
}
</script>
<style>
.helpItem{
}
.wrapper{
    flex:1;
    width: 750px;
    flex-direction: column;
    justify-content: flex-start;
    align-items: center;
    background-color: #fff;
}
.title{
    margin-top: 20px;
    width: 680x;
    font-size: 35px;
    font-family: PingFangSC-Regular;
    color: #333333;
}
.content{
    margin-top: 80px;
    width: 680px;
    font-size: 26px;
    color: #999999;
    font-family: PingFangSC-Regular;
}
</style>
